In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [2]:
import sklearn
sklearn.__version__

'1.0.1'

In [3]:
from sklearn.experimental import enable_iterative_imputer

In [4]:
data = pd.DataFrame({'age':[25,27,29,31,33,np.nan],
                    'exp':[np.nan,3,5,7,9,11],
                    'salary':[50,np.nan,110,140,170,200],
                    'purchased':[0,1,1,0,1,0]
                   })
data

    age   exp  salary  purchased
0  25.0   NaN    50.0          0
1  27.0   3.0     NaN          1
2  29.0   5.0   110.0          1
3  31.0   7.0   140.0          0
4  33.0   9.0   170.0          1
5   NaN  11.0   200.0          0

In [8]:
#spliting the data to train and test

x = data.drop('purchased',axis=1)
y = data['purchased']

In [9]:
x

    age   exp  salary
0  25.0   NaN    50.0
1  27.0   3.0     NaN
2  29.0   5.0   110.0
3  31.0   7.0   140.0
4  33.0   9.0   170.0
5   NaN  11.0   200.0

In [10]:
x.corr()

        age  exp  salary
age     1.0  1.0     1.0
exp     1.0  1.0     1.0
salary  1.0  1.0     1.0